import random

def generate_X():
    """
        დისკრეტული შემთხვევითი სიდიდის X გენერაცია
        შებრუნებული გარდაქმნის მეთოდით

        განაწილება:
        P(X = -5) = 0.4
        P(X =  0) = 0.2
        P(X =  5) = 0.4
    """

    """
        შემდეგ, კუმულაციური ალბათობების მიხედვით (CDF - Cumulative Distribution Function) განისაზღვრება X-ის მნიშვნელობა:
        CDF(-5) = 0.4
        CDF(0) = 0.4 + 0.2 = 0.6
        CDF(5) = 0.6 + 0.4 = 1.0

        თუ u მოხვდება შესაბამის ინტერვალში, დაბრუნდება შესაბამისი მნიშვნელობა.
    """

    # 1. შემთხვევითი რიცხვის გენერაცია U ~ Uniform(0,1)
    U = random.random()
    # print(U)

    # 2. შებრუნებული გარდაქმნის წესის გამოყენება
    if U < 0.4:
        X = -5
    elif U < 0.6:
        X = 0
    else:
        X = 5

    return X


# ==========================
# ფუნქციის ტესტირება
# ==========================

for i in range(10):
    print(f"X_{i+1} = {generate_X()}")
